Terraform plan for __production__
<details>
  <summary>Plan: 7 to add, 2 to change, 6 to destroy.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.cloudfoundry_service.k8s will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_service" "k8s"  {
      ~ id                  = "************************************" -> (known after apply)
        name                = "aws-eks-service"
      ~ service_broker_name = "ssb-gsa-datagov-management" -> (known after apply)
      ~ service_plans       = {
          - "raw" = "2fc05cad-530a-4e7e-8729-cfd81447eb4d"
        } -> (known after apply)
    }

  # cloudfoundry_app.ssb will be destroyed
  - resource "cloudfoundry_app" "ssb" {
      - buildpack            = "binary_buildpack" -> null
      - command              = "source .profile && ./cloud-service-broker serve" -> null
      - disk_quota           = 2048 -> null
      - enable_ssh           = false -> null
      - environment          = (sensitive value)
      - health_check_timeout = 0 -> null
      - health_check_type    = "port" -> null
      - id                   = "a2c28ec7-97a0-4c4e-8010-7272a23ecb81" -> null
      - id_bg                = "a2c28ec7-97a0-4c4e-8010-7272a23ecb81" -> null
      - instances            = 1 -> null
      - memory               = 512 -> null
      - name                 = "ssb" -> null
      - path                 = "./app.zip" -> null
      - ports                = [
          - 8080,
        ] -> null
      - source_code_hash     = "3GGCTpBoxRtoa2jyyx/eJrHZ4OWuNn6voy0tcRFTNLI=" -> null
      - space                = "9a1db116-0180-42be-8ffa-7944dcf6bf50" -> null
      - stack                = "ad34309f-ab24-4c3d-9ad1-eb0da8378bd4" -> null
      - stopped              = false -> null
      - strategy             = "blue-green" -> null
      - timeout              = 60 -> null

      - routes {
          - port  = 8080 -> null
          - route = "32a63578-b902-4648-92ab-5a945d16c6a1" -> null
        }

      - service_binding {
          - params           = (sensitive value)
          - service_instance = "3c9a0f58-c784-4f71-8872-f2052c95df43" -> null
        }
    }

  # cloudfoundry_route.ssb_uri will be destroyed
  - resource "cloudfoundry_route" "ssb_uri" {
      - domain   = "50ba3f69-cd54-4963-9172-14f3334b479e" -> null
      - endpoint = "ssb-deep-dingo.app.cloud.gov" -> null
      - hostname = "ssb-deep-dingo" -> null
      - id       = "32a63578-b902-4648-92ab-5a945d16c6a1" -> null
      - space    = "9a1db116-0180-42be-8ffa-7944dcf6bf50" -> null
    }

  # cloudfoundry_service_instance.db will be destroyed
  - resource "cloudfoundry_service_instance" "db" {
      - id               = "3c9a0f58-c784-4f71-8872-f2052c95df43" -> null
      - name             = "ssb-db" -> null
      - recursive_delete = false -> null
      - service_plan     = "3a8e624f-ba5a-4435-8fa4-ee955b103bae" -> null
      - space            = "9a1db116-0180-42be-8ffa-7944dcf6bf50" -> null
      - tags             = [
          - "mysql",
        ] -> null
    }

  # cloudfoundry_service_instance.k8s_cluster will be created
  + resource "cloudfoundry_service_instance" "k8s_cluster" {
      + id               = (known after apply)
      + name             = "ssb-k8s"
      + recursive_delete = false
      + service_plan     = (known after apply)
      + space            = "9a1db116-0180-42be-8ffa-7944dcf6bf50"
      + tags             = [
          + "k8s",
        ]

      + timeouts {
          + create = "30m"
        }
    }

  # random_password.client_password will be destroyed
  - resource "random_password" "client_password" {
      - id               = "none" -> null
      - length           = 16 -> null
      - lower            = true -> null
      - min_lower        = 0 -> null
      - min_numeric      = 0 -> null
      - min_special      = 0 -> null
      - min_upper        = 0 -> null
      - number           = true -> null
      - override_special = "_%@" -> null
      - result           = (sensitive value)
      - special          = true -> null
      - upper            = true -> null
    }

  # random_pet.client_hostname will be destroyed
  - resource "random_pet" "client_hostname" {
      - id        = "deep-dingo" -> null
      - length    = 2 -> null
      - separator = "-" -> null
    }

  # random_uuid.client_username will be destroyed
  - resource "random_uuid" "client_username" {
      - id     = "a1582ac8-4a25-1669-b5ca-af0011e0ab25" -> null
      - result = "a1582ac8-4a25-1669-b5ca-af0011e0ab25" -> null
    }

  # module.broker_aws.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
      ~ enable_ssh           = true -> false
        id                   = "b5e6c786-d69f-4085-93d2-61d878ac75e7"
        name                 = "ssb-aws"
        # (17 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.broker_eks.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
      ~ enable_ssh           = true -> false
        id                   = "70486ef6-b83a-4e01-a85c-bcfd2fd36a68"
      ~ id_bg                = "************************************" -> (known after apply)
        name                 = "ssb-eks"
        # (16 unchanged attributes hidden)


      + service_binding {
          + service_instance = (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # module.broker_eks.cloudfoundry_service_instance.db will be created
  + resource "cloudfoundry_service_instance" "db" {
      + id               = (known after apply)
      + name             = "ssb-eks-db"
      + recursive_delete = false
      + service_plan     = "3a8e624f-ba5a-4435-8fa4-ee955b103bae"
      + space            = "9a1db116-0180-42be-8ffa-7944dcf6bf50"
      + tags             = [
          + "mysql",
        ]
    }

  # module.broker_solr.cloudfoundry_app.ssb will be created
  + resource "cloudfoundry_app" "ssb" {
      + buildpack                  = "binary_buildpack"
      + command                    = "source .profile && ./cloud-service-broker serve"
      + disk_quota                 = 2048
      + enable_ssh                 = false
      + environment                = (sensitive value)
      + health_check_http_endpoint = (known after apply)
      + health_check_timeout       = (known after apply)
      + health_check_type          = "port"
      + id                         = (known after apply)
      + id_bg                      = (known after apply)
      + instances                  = 1
      + memory                     = 256
      + name                       = "ssb-solr"
      + path                       = "./app-ssb-solr.zip"
      + ports                      = (known after apply)
      + source_code_hash           = "RrwYpMoh/xKGoHOwyE8XYO3+Ef1OCBgQow1ZUZ/qeN8="
      + space                      = "9a1db116-0180-42be-8ffa-7944dcf6bf50"
      + stack                      = (known after apply)
      + stopped                    = false
      + strategy                   = "blue-green"
      + timeout                    = 60

      + routes {
          + port  = (known after apply)
          + route = "178725bd-3eda-4a84-abd6-a848305978d5"
        }

      + service_binding {
          + service_instance = "3c73e801-d72e-4c60-aec7-26a29edab9dc"
        }
      + service_binding {
          + service_instance = (known after apply)
        }
    }

  # module.broker_solr.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/development"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = true
      + id                               = (known after apply)
      + name                             = "ssb-ssb-solr-gsa-datagov-development"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "eab3d327-7d9f-423b-9838-753c26fdb5a0"
      + url                              = "https://ssb-improved-bunny.app.cloud.gov"
      + username                         = "63d2d47d-f315-c647-31fd-9d60600fee89"
    }

  # module.broker_solr.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/management"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = true
      + id                               = (known after apply)
      + name                             = "ssb-ssb-solr-gsa-datagov-management"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "9a1db116-0180-42be-8ffa-7944dcf6bf50"
      + url                              = "https://ssb-improved-bunny.app.cloud.gov"
      + username                         = "63d2d47d-f315-c647-31fd-9d60600fee89"
    }

  # module.broker_solr.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/prod"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = true
      + id                               = (known after apply)
      + name                             = "ssb-ssb-solr-gsa-datagov-prod"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "acbabadb-2604-4736-81f7-01288b0371c6"
      + url                              = "https://ssb-improved-bunny.app.cloud.gov"
      + username                         = "63d2d47d-f315-c647-31fd-9d60600fee89"
    }

  # module.broker_solr.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/staging"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = true
      + id                               = (known after apply)
      + name                             = "ssb-ssb-solr-gsa-datagov-staging"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "3e692cdd-6d26-41ea-9698-04903dc3f742"
      + url                              = "https://ssb-improved-bunny.app.cloud.gov"
      + username                         = "63d2d47d-f315-c647-31fd-9d60600fee89"
    }

Plan: 7 to add, 2 to change, 6 to destroy.
```
</details>

Plan generated in [plan #14](https://github.com/GSA/datagov-ssb/actions/runs/665635068)